In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(pd.read_csv("./data/raw_data.csv"))

In [4]:
country_data = df.groupby("country")["income"].mean()
country_data

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [5]:
df.groupby("country")["income"].agg(["mean","min","max"])

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

In [6]:
# Rename the columns
df.groupby("country")["income"].agg(avg_income = "mean",min_income = "min",max_income = "max")

         avg_income  min_income  max_income
country
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India       73000.0     73000.0     73000.0
Mexico      45000.0     45000.0     45000.0
Spain           NaN         NaN         NaN
USA         55400.0     47000.0     62000.0

In [7]:
df.groupby("country").aggregate({
    "income":"max",
    "age":"mean"
})

          income   age
country
Canada   62000.0   NaN
China    51000.0  27.0
India    73000.0  45.0
Mexico   45000.0   NaN
Spain        NaN  34.0
USA      62000.0  29.5